"""
Програми:
- PyCharm Community Edition
- python 3.8

Необхідна теорія:
- змінні (variables)
- найпростіші типи даних (types)
    - строки (str, string)
    - цілі числа (int, integer)
    - логічний/булевий тип (bool, boolean)
- цикли (loops, while, for)
- операції на числах
"""

import random

while True:
    # randint = random integer = випадкове ціле (число)
    перший_доданок = random.randint(1, 20)
    другий_доданок = random.randint(1, 20)

    приклад_як_строка = f'{перший_доданок} + {другий_доданок} = '
    # breakpoint - точка зупинки
    відповідь_користувача = input(приклад_як_строка)
    відповідь_користувача = int(відповідь_користувача)

    правильна_відповідь = перший_доданок + другий_доданок
    if відповідь_користувача == правильна_відповідь:
        print('молодець')
    else:
        print('спробуй ще')
    print()

