поле_гри = [
    ['_', '_', '_'],
    ['_', '_', '_'],
    ['_', '_', '_'],
]

while True:
    for рядок in поле_гри:
        красива_презентація = ' '.join(рядок)
        print(красива_презентація)

    координати = input('Введіть координати, наприклад "1 1": ')
    координати = координати.split()
    номер_рядку = int(координати[0])
    номер_колонки = int(координати[1])
    рядок = поле_гри[номер_рядку]
    знак_у_клітинці = рядок[номер_колонки]
    if знак_у_клітинці != '_':
        print('клітинка вже зайнята')
        continue
    рядок[номер_колонки] = 'X'

    print()


