словник_правильних_слів = [
    # https://www.youtube.com/watch?v=MJzz9AGh_NI&ab_channel=%D0%A5%D0%A3%D0%9D%D0%A2%D0%90_TV
    'дехто', 'говоре', 'бандити', 'хулiгани',
    'з', 'тої', 'голоти', 'людей', 'не', 'буде',
    'а', 'ми', 'ся', 'подивим', 'як', 'потреба', 'стане',
    'хто', 'полiзе', 'в', 'льох', 'а', 'хто', 'пiд', 'кулi', 'пiде',
    'то', 'ми', 'хлопцi', 'з', 'бандерштат',
    'ходимо', 'до', 'церкви', 'шануємо', 'батькiв',

    'ходив', 'подив', 'подих',
]

while True:
    print()

    слово = input('введіть слово: ')
    if слово in словник_правильних_слів:
        print('правильне слово без змін')
        continue

    знайдено_правильне_слово = False
    for i in range(len(слово)):
        перша_частина = слово[:i]
        друга_частина = слово[i + 1:]
        слово_з_вирізаною_однією_буквою = перша_частина + друга_частина
        if слово_з_вирізаною_однією_буквою in словник_правильних_слів:
            print(f'знайдено схоже правильне слово: {слово_з_вирізаною_однією_буквою}')
            знайдено_правильне_слово = True

    if not знайдено_правильне_слово:
        print('не знайдено схожого правильного слова')
