import random

розмір_класу = 23
кількість_співпадінь = 0
кількість_класів = 100000

for i in range(кількість_класів):
    дні_народження = []
    for людина in range(розмір_класу):
        день_народження = random.randint(1, 365)
        if день_народження in дні_народження:
            кількість_співпадінь = кількість_співпадінь + 1
            break
        дні_народження.append(день_народження)

відсоток = 100 * кількість_співпадінь / кількість_класів
print(
    f'Доля класів з {розмір_класу} дітьми у яких є як мінімум одна пара '
    f'дітей у яких день народження в один день становить {відсоток}%'
)
