"""
Формулювання задачі:
Яка ймовірність того що у (випадковій) групі з 23 учнів як мінімум у двох дітей
день народження буде в один день?

Заспокоєння: тут не буде жодних статистичних формул.
Лише 2 вкладених for цикла =)

Переформулювання задачі:
Згенеруйте 10 тис груп що складаються 23 учнів.
Для кожного учня згенеруйте його день народження випадковим чином.
Будь-яка інша інформація про учня не є цікавою у контексті цієї задачі (стать, їм'я, і т. д.)
Порахуйте у якої кількості груп спостегірається співпадіння 2 днів народжень (я мінімум) у
будь-яких двох учнів.
Маючи кількість груп і кількість співпадінь розрахуйте відсоток співпадінь.
"""

import random

РОЗМІР_ГРУПИ = 23
КІЛЬКІСТЬ_ГРУП_У_МОДЕЛЮВАННІ = 10000

кількість_співпадінь = 0

for номер_змодельованої_групи in range(КІЛЬКІСТЬ_ГРУП_У_МОДЕЛЮВАННІ):
    дні_народження_у_поточній_групі = []
    for учень in range(РОЗМІР_ГРУПИ):
        # 15 січня = 15 днів з початку року
        # 12 лютого = 31 + 12 = 43 дні з початку року
        # 31 грудня = 365 днів з початку року
        # літо починається приблизно у 150 день
        # осінь починається приблизно у 245 день, і т. д.
        день_народження = random.randint(1, 365)
        if день_народження in дні_народження_у_поточній_групі:
            кількість_співпадінь = кількість_співпадінь + 1
            break
        дні_народження_у_поточній_групі.append(день_народження)

частка = кількість_співпадінь / КІЛЬКІСТЬ_ГРУП_У_МОДЕЛЮВАННІ
відсоток = 100 * частка
print(
    f'Частка груп розміром у {РОЗМІР_ГРУПИ} учні у яких є як мінімум одна пара '
    f'учнів які святкують ДН в один день становить {відсоток}%'
)
