товари = [
    ['Телефон', 10],
    ['Гиря', 1.4],
    ['Ноутбук', 25],
    ['Део Ланос', 120],
    ['Акції МММ', 1],
    ['Гімнастичні кільця', 1.2],
    ['Золото 100 грам', 150],
    ['Сокира', 1.666],
    ['Гарі Потер і Методи Раціональності (набір книг)', 1.6]
]

обрані_товари = []

while True:
    команда = input('Введіть одну із команд: "т" (товари), "к" (корзина), "в" (вихід): ')
    if команда == 'т':
        порядковий_номер = 0
        for товар in товари:
            назва = товар[0]
            ціна = товар[1]
            print(f'{порядковий_номер}) {назва} - {ціна} тис. грн')
            порядковий_номер = порядковий_номер + 1
        обраний_номер = input(
            'Введіть номер товару який ви хочете додати. Якщо '
            'нічого не хочете додавати то просто натисніть Enter: '
        )
        if обраний_номер:
            обраний_номер = int(обраний_номер)
            обраний_товар = товари[обраний_номер]
            обрані_товари.append(обраний_товар)

    elif команда == 'к':
        порядковий_номер = 0
        сумарна_вартість = 0
        for товар in обрані_товари:
            назва = товар[0]
            ціна = товар[1]
            print(f'{порядковий_номер}) {назва} - {ціна} тис. грн')
            порядковий_номер = порядковий_номер + 1
            сумарна_вартість = сумарна_вартість + ціна
        if обрані_товари:
            обраний_номер = input(
                'Введіть номер товару який ви хочете видалити. Якщо '
                'нічого не хочете видаляти то просто натисніть Enter: '
            )
            if обраний_номер:
                обраний_номер = int(обраний_номер)
                del обрані_товари[обраний_номер]

    elif команда == 'e':
        print('Магазин зачиняється')
        break
    else:
        print('Невідома команда')
    print()
